In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
dsales = { 'y1': {'q1':4500, 'q2':7500,'q3':7800,'q4':7200},\
           'y2': {'q1':4000, 'q2':7500,'q3':7801,'q4':7202},\
          'y3': {'q1':4800, 'q2':7600,'q3':7841,'q4':7502},\
                }
df1=pd.DataFrame(dsales)

In [4]:
df1

      y1    y2    y3
q1  4500  4000  4800
q2  7500  7500  7600
q3  7800  7801  7841
q4  7200  7202  7502

In [5]:
for(row,rowSeries) in df1.iterrows():
    print("Row index:",row)
    print("Containing :")
    print(rowSeries)

Row index: q1
Containing :
y1    4500
y2    4000
y3    4800
Name: q1, dtype: int64
Row index: q2
Containing :
y1    7500
y2    7500
y3    7600
Name: q2, dtype: int64
Row index: q3
Containing :
y1    7800
y2    7801
y3    7841
Name: q3, dtype: int64
Row index: q4
Containing :
y1    7200
y2    7202
y3    7502
Name: q4, dtype: int64

In [6]:
for(col,colSeries) in df1.iteritems():
    print("Column index:",col)
    print("Containing :")
    print(colSeries)

Column index: y1
Containing :
q1    4500
q2    7500
q3    7800
q4    7200
Name: y1, dtype: int64
Column index: y2
Containing :
q1    4000
q2    7500
q3    7801
q4    7202
Name: y2, dtype: int64
Column index: y3
Containing :
q1    4800
q2    7600
q3    7841
q4    7502
Name: y3, dtype: int64

In [7]:
stu={"Name":{1:"Hirani",2:"peter",3:"simrat",4:"DOjha"}}

In [8]:
df11=pd.DataFrame(stu)

In [9]:
df11

     Name
1  Hirani
2   peter
3  simrat
4   DOjha

In [10]:
add={"Address":{1:"Haryana",2:"punjab",3:"shimla",4:"Orissa"}}

In [11]:
df12=pd.DataFrame(add)

In [12]:
df12

   Address
1  Haryana
2   punjab
3   shimla
4   Orissa

In [13]:
df13=df11.join(df12)

In [14]:
df13

     Name  Address
1  Hirani  Haryana
2   peter   punjab
3  simrat   shimla
4   DOjha   Orissa

In [15]:
com={"Competition":{1:"pass",3:"distinction",13:"fail",14:"Outstanding"}}

In [16]:
df14=pd.DataFrame(com)

In [17]:
df14

    Competition
1          pass
3   distinction
13         fail
14  Outstanding

In [18]:
df15=df11.join(df14)
df15

     Name  Competition
1  Hirani         pass
2   peter          NaN
3  simrat  distinction
4   DOjha          NaN

In [19]:
df16=df11.join(df14,how="left")
df16

     Name  Competition
1  Hirani         pass
2   peter          NaN
3  simrat  distinction
4   DOjha          NaN

In [20]:
df17=df11.join(df14,how="right")
df17

      Name  Competition
1   Hirani         pass
3   simrat  distinction
13     NaN         fail
14     NaN  Outstanding

In [21]:
df18=df11.join(df14,how="inner")
df18

     Name  Competition
1  Hirani         pass
3  simrat  distinction

In [22]:
df19=df11.join(df14,how="outer")
df19

      Name  Competition
1   Hirani         pass
2    peter          NaN
3   simrat  distinction
4    DOjha          NaN
13     NaN         fail
14     NaN  Outstanding